app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Load here all helpers you want to be available in your controllers that extend BaseController.
        // Caution: Do not put the this below the parent::initController() call below.
        // $this->helpers = ['form', 'url'];

        // Caution: Do not edit this line.
        parent::initController($request, $response, $logger);

        // Preload any models, libraries, etc, here.
        // $this->session = service('session');

        // Fetch notifikasi untuk admin
        if (session()->get('role') == 'admin') {
            $notifikasiModel = new \App\Models\NotifikasiModel();
            $this->notifikasi = $notifikasiModel->where('id_user', session()->get('id_user'))
                                                 ->orderBy('id_notifikasi', 'DESC')
                                                 ->findAll();
---
SELECT *
FROM `notifikasi`
WHERE `id_user` = '1234'
ORDER BY `id_notifikasi` DESC