app/Controllers/Dashboard.php

    public function index()
    {
        $db = \Config\Database::connect();

        // =======================
        // 🔔 NOTIFIKASI (FIX)
        // =======================
        $notifikasi = $db->table('notifikasi')
            ->where('id_user', session()->get('id_user'))
            ->where('status', 'baru') // 🔥 penting
            ->orderBy('id_notifikasi', 'DESC')
            ->get()
            ->getResultArray();

        // =======================
        // DATA PENGADUAN
        // =======================
        $builder = $db->table('pengaduan');
        $builder->select('pengaduan.*, users.nama');
        $builder->join('users', 'users.id_user = pengaduan.id_user', 'left');

        if (session()->get('role') != 'admin') {
            $builder->where('pengaduan.id_user', session()->get('id_user'));
        }

        $builder->orderBy('pengaduan.id_pengaduan', 'DESC');
        $pengaduan = $builder->get()->getResultArray();
---
SELECT *
FROM `notifikasi`
WHERE `id_user` = '1234'
AND `status` = 'baru'
ORDER BY `id_notifikasi` DESC
SELECT `pengaduan`.*, `users`.`nama`
FROM `pengaduan`
LEFT JOIN `users` ON `users`.`id_user` = `pengaduan`.`id_user`
WHERE `pengaduan`.`id_user` = '1239'
ORDER BY `pengaduan`.`id_pengaduan` DESC

            ->whereIn('status', ['proses', 'diproses'])
            ->countAllResults();

        $selesai = $db->table('pengaduan')
            ->where('status', 'selesai')
            ->countAllResults();

        // =======================
        // TOTAL USER
        // =======================
        $total_user = $db->table('users')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pengaduan`
WHERE `status` IN ('proses','diproses')
SELECT COUNT(*) AS `numrows`
FROM `users`