app/Controllers/Dashboard.php

    public function index()
    {
        $db = \Config\Database::connect();

        // ===================================
        // 🔔 NOTIFIKASI (KHUSUS ADMIN SAJA)
        // ===================================
        $notifikasi = [];

        if (session()->get('role') == 'admin') {

            // jika ada pengaduan baru status menunggu
            $cekPengaduanBaru = $db->table('pengaduan')
                ->where('status', 'menunggu')
                ->countAllResults();

            // jika ada dan notif belum ada → insert notif otomatis
            if ($cekPengaduanBaru > 0) {

                $cekNotif = $db->table('notifikasi')
                    ->where('pesan', 'Ada pengaduan baru dari user')
                    ->where('status', 'baru')
                    ->countAllResults();

                if ($cekNotif == 0) {
                    $db->table('notifikasi')->insert([
                        'id_user' => session()->get('id_user'),
                        'pesan'   => 'Ada pengaduan baru dari user',
                        'status'  => 'baru'
                    ]);
---
SELECT COUNT(*) AS `numrows`
FROM `pengaduan`
WHERE `status` = 'menunggu'
SELECT COUNT(*) AS `numrows`
FROM `notifikasi`
WHERE `pesan` = 'Ada pengaduan baru dari user'
AND `status` = 'baru'
INSERT INTO `notifikasi` (`id_user`, `pesan`, `status`) VALUES ('1234', 'Ada pengaduan baru dari user', 'baru')

            }

            // ambil notifikasi admin
            $notifikasi = $db->table('notifikasi')
                ->where('id_user', session()->get('id_user'))
                ->where('status', 'baru')
                ->orderBy('id_notifikasi', 'DESC')
                ->get()
                ->getResultArray();
---
SELECT *
FROM `notifikasi`
WHERE `id_user` = '1234'
AND `status` = 'baru'
ORDER BY `id_notifikasi` DESC


        if (session()->get('role') == 'admin') {

            $diproses = $db->table('pengaduan')
                ->whereIn('status', ['proses', 'diproses'])
                ->countAllResults();

            $selesai = $db->table('pengaduan')
                ->where('status', 'selesai')
                ->countAllResults();

            $ditolak = $db->table('pengaduan')
                ->where('status', 'ditolak')
                ->countAllResults();

            $total_user = $db->table('users')
                ->where('role !=', 'admin')
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pengaduan`
WHERE `status` IN ('proses','diproses')
SELECT COUNT(*) AS `numrows`
FROM `pengaduan`
WHERE `status` = 'selesai'
SELECT COUNT(*) AS `numrows`
FROM `pengaduan`
WHERE `status` = 'ditolak'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` != 'admin'