app/Controllers/Pengaduan.php

    public function create()
{
    $db = \Config\Database::connect();

    $data['aspirasi'] = $db->table('aspirasi')
        ->get()
        ->getResultArray();
---
SELECT *
FROM `aspirasi`

        $builder->groupBy('pengaduan.id_pengaduan');

        $data['pengaduan'] = $builder->get()->getResultArray();
        $data['aspirasi'] = $db->table('aspirasi')->get()->getResultArray();
---
SELECT *
FROM `aspirasi`