app/Controllers/Pengaduan.php

    public function create()
    {
        $db = \Config\Database::connect();
        $data['aspirasi'] = $db->table('aspirasi')->get()->getResultArray();
---
SELECT *
FROM `aspirasi`