app/Controllers/Pengaduan.php

SELECT *
FROM `aspirasi`
---
    public function create()
{
    $db = \Config\Database::connect();

    $data['aspirasi'] = $db->table('aspirasi')
        ->get()
        ->getResultArray();

SELECT *
FROM `feedback`
WHERE `id_pengaduan` = '69'
 LIMIT 1
SELECT *
FROM `pengaduan`
WHERE `pengaduan`.`id_pengaduan` = '69'
---
    public function feedback($id)
    {
        $data['pengaduan'] = $this->pengaduan->find($id);

        $feedbackModel = new \App\Models\FeedbackModel();
        $data['feedback'] = $feedbackModel->where('id_pengaduan', $id)->first();

INSERT INTO `feedback` (`id_pengaduan`, `isi_feedback`) VALUES ('44', 'dahh')
UPDATE `pengaduan` SET `status` = 'selesai'
WHERE `pengaduan`.`id_pengaduan` IN ('44')
---
    public function saveFeedback()
    {
        $model = new \App\Models\FeedbackModel();

        $model->save([
            'id_pengaduan' => $this->request->getPost('id_pengaduan'),
            'isi_feedback' => $this->request->getPost('isi_feedback')
        ]);

        // ubah status otomatis
        $this->pengaduan->update(
            $this->request->getPost('id_pengaduan'),
            ['status' => 'selesai']
        );

SELECT *
FROM `feedback`
WHERE `id_pengaduan` = '65'
 LIMIT 1
SELECT *
FROM `pengaduan`
WHERE `pengaduan`.`id_pengaduan` = '65'
---
    public function print()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('pengaduan');

        $builder->select('pengaduan.*,
                          feedback.isi_feedback,
                          users.nama,
                          aspirasi.kategori');

        $builder->join('feedback', 'feedback.id_pengaduan = pengaduan.id_pengaduan', 'left');
        $builder->join('users', 'users.id_user = pengaduan.id_user', 'left');
        $builder->join('aspirasi', 'aspirasi.id_aspirasi = pengaduan.id_aspirasi', 'left');

        if (session()->get('role') != 'admin') {
            $builder->where('pengaduan.id_user', session()->get('id_user'));
        }

        $builder->orderBy('pengaduan.id_pengaduan', 'DESC');

        $data['pengaduan'] = $builder->get()->getResultArray();

SELECT `pengaduan`.*, `users`.`nama`, `aspirasi`.`kategori`, `feedback`.`isi_feedback`
FROM `pengaduan`
LEFT JOIN `users` ON `users`.`id_user` = `pengaduan`.`id_user`
LEFT JOIN `aspirasi` ON `aspirasi`.`id_aspirasi` = `pengaduan`.`id_aspirasi`
LEFT JOIN `feedback` ON `feedback`.`id_pengaduan` = `pengaduan`.`id_pengaduan`
WHERE `pengaduan`.`id_user` = '1239'
ORDER BY `pengaduan`.`id_pengaduan` DESC
SELECT *
FROM `aspirasi`
SELECT *
FROM `progres_pengaduan`
ORDER BY `tanggal` ASC
---
    public function history()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('pengaduan');

        $builder->select('pengaduan.*, users.nama, aspirasi.kategori, feedback.isi_feedback');
        $builder->join('users', 'users.id_user = pengaduan.id_user', 'left');
        $builder->join('aspirasi', 'aspirasi.id_aspirasi = pengaduan.id_aspirasi', 'left');
        $builder->join('feedback', 'feedback.id_pengaduan = pengaduan.id_pengaduan', 'left');

        if (session()->get('role') != 'admin') {
            $builder->where('pengaduan.id_user', session()->get('id_user'));
        }

        $builder->orderBy('pengaduan.id_pengaduan', 'DESC');

        $pengaduan = $builder->get()->getResultArray();

        $allProgres = $db->table('progres_pengaduan')
            ->orderBy('tanggal', 'ASC')
            ->get()->getResultArray();

SELECT *
FROM `aspirasi`
---
        $builder->groupBy('pengaduan.id_pengaduan');

        $data['pengaduan'] = $builder->get()->getResultArray();
        $data['aspirasi'] = $db->table('aspirasi')->get()->getResultArray();